; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph4 - mode
	infrared0 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	infrared6 - mode
	infrared1 - mode
	image5 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star5 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(supports instrument2 infrared6)
	(calibration_target instrument2 Star5)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 spectrograph2)
	(supports instrument4 image5)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 thermograph4)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared6)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Phenomenon8 image5)
	(have_image Phenomenon8 spectrograph3)
	(have_image Planet9 thermograph4)
	(have_image Planet9 infrared6)
	(have_image Phenomenon10 infrared6)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 infrared6)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 thermograph4)
	(have_image Phenomenon12 infrared6)
	(have_image Star13 image5)
))

)

; plan
1. (turn_to satellite2 star0 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star0)
   goals met: 0 of 12
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite2 star13 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star13)
   goals met: 0 of 12
5. (take_image satellite2 star13 instrument4 image5)
   added: (have_image star13 image5)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon8 instrument4 image5)
   added: (have_image phenomenon8 image5)
   goals met: 2 of 12
8. (turn_to satellite2 star5 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star5)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 12
10. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 3 of 12
11. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 3 of 12
12. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 3 of 12
13. (calibrate satellite2 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 3 of 12
14. (turn_to satellite2 phenomenon10 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 12
15. (take_image satellite2 phenomenon10 instrument2 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 4 of 12
16. (take_image satellite2 phenomenon10 instrument2 infrared6)
   added: (have_image phenomenon10 infrared6)
   goals met: 5 of 12
17. (turn_to satellite2 phenomenon12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 12
18. (take_image satellite2 phenomenon12 instrument2 infrared6)
   added: (have_image phenomenon12 infrared6)
   goals met: 6 of 12
19. (turn_to satellite2 planet9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet9)
   goals met: 6 of 12
20. (take_image satellite2 planet9 instrument2 infrared6)
   added: (have_image planet9 infrared6)
   goals met: 7 of 12
21. (turn_to satellite2 star11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star11)
   goals met: 7 of 12
22. (take_image satellite2 star11 instrument2 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 12
23. (take_image satellite2 star11 instrument2 infrared6)
   added: (have_image star11 infrared6)
   goals met: 9 of 12
24. (turn_to satellite3 groundstation2 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 groundstation2)
   goals met: 9 of 12
25. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 9 of 12
26. (turn_to satellite3 phenomenon12 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon12)
   goals met: 9 of 12
27. (take_image satellite3 phenomenon12 instrument6 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 10 of 12
28. (turn_to satellite3 phenomenon8 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon8)
   goals met: 10 of 12
29. (take_image satellite3 phenomenon8 instrument6 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 11 of 12
30. (turn_to satellite3 planet9 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet9)
   goals met: 11 of 12
31. (take_image satellite3 planet9 instrument6 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 12 of 12
